leetcode_1345_jump_game_iv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1345. Jump Game IV</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1345. Jump Game IV</h1>
<p>
<a href="https://leetcode.com/problems/jump-game-iv/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_bug_caused_by_debug_code.html#ID-00CC89B4-340B-4219-9CF4-837F558947B4">Mistake: Bug caused by debug code</a>.</li>

<li><a href="can_we_formulate_the_problem_using_graphs.html#ID-DA1E3A63-73BB-475E-B087-128602B13450">Can we formulate the problem using graphs?</a>  Each element of the array is a vertex and edges are created following the rules.  The problem becomes finding the <a href="shortest_path_in_a_graph_problem.html#ID-8BACB101-3C8B-47CA-9AB1-89D52F85F6DA">Shortest Path in a Graph Problem</a> which can be done by a <a href="breadth_first_search.html#ID-AF8E855B-7F09-4A2C-BA75-DBA1FFEEF56F">Breadth-first search</a> since edges have no weight.  Time and space complexity is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minJumps</span>(<span style="font-weight: bold;">self</span>, arr: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        adj = defaultdict(<span style="font-weight: bold;">list</span>)
        <span style="font-weight: bold;">for</span> i, a <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(arr):
            adj[a].append(i)

        <span style="font-weight: bold; font-style: italic;">N</span> = <span style="font-weight: bold;">len</span>(arr)
        <span style="font-weight: bold; font-style: italic;">vis</span> = [<span style="font-weight: bold; text-decoration: underline;">False</span>] * N

        <span style="font-weight: bold; font-style: italic;">queue</span> = [(0, 0)]
        <span style="font-weight: bold; font-style: italic;">vis</span>[0] = <span style="font-weight: bold; text-decoration: underline;">True</span>

        <span style="font-weight: bold;">for</span> (steps, i) <span style="font-weight: bold;">in</span> queue:
            <span style="font-weight: bold;">if</span> i == N - 1:
                <span style="font-weight: bold;">return</span> steps
            <span style="font-weight: bold;">while</span> adj[arr[i]]:
                j = adj[arr[i]].pop()
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> vis[j]:
                    vis[<span style="font-weight: bold; font-style: italic;">j</span>] = <span style="font-weight: bold; text-decoration: underline;">True</span>
                    queue.append((steps + 1, j))
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> i + 1, i - 1:
                <span style="font-weight: bold;">if</span> 0 &lt;= j &lt; N <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">not</span> vis[j]:
                    vis[<span style="font-weight: bold; font-style: italic;">j</span>] = <span style="font-weight: bold; text-decoration: underline;">True</span>
                    queue.append((steps + 1, j))


<span style="font-weight: bold;">assert</span> Solution().minJumps([100, -23, -23, 404, 100, 23, 23, 23, 3, 404]) == 3
<span style="font-weight: bold;">assert</span> Solution().minJumps([7]) == 0
<span style="font-weight: bold;">assert</span> Solution().minJumps([7, 6, 9, 6, 9, 6, 9, 7]) == 1
</pre>
</div>
</div>
</body>
</html>